#include <stdio.h>
void main(){//先编译后才能调试 
	//两数交换 
	int a = 6;
	int b = 5;
	int temp;
	temp = a;
	a = b;
	b = temp;
	printf("a=%d,b=%d\n",a,b);
	//a=5,b=6 
	
	//c语言与java一样，拥有相同的复合运算符和递增递减运算符
	//即+=、-=、/=、%=、*= 以及 ++、--
	//而递增递减运算符java不同于c之处在于其返回结果的严格性
	//a++或a--表达式返回的值为a原来的值
	//++a或--a表达式返回的值为a+1或a-1的值 
	printf("a++得到%d,",a++);//输出“a++得到5”,此处是先输出a原来的值，再使a自增 
	printf("a=%d\n",a);//输出a=6 
	printf("++a得到%d,",++a);//输出“++a得到7” 
	printf("a=%d\n",a);//输出a=7 
	
	printf("a++得到%d,++a得到%d",a++,++a);
	//*奇怪的是，这里输出"a++得到8,++a得到9" ,此时a++呈现的结果确实输出自增后的值 
}
